# this is a list of keywords to highlight in python-keyword-mode
# Each headline is the keyword, and has a property of :python: which is used to access pydoc information
# The contents of the heading are shown as a tooltip.
* format
  :PROPERTIES:
  :python:   format
  :END:

s = 'an integer: {0}'.format(5)

#+BEGIN_SRC python
print('a float with 2 decimals: {0:1.2f}'.format(5))
#+END_SRC

#+RESULTS:
: a float with 2 decimals: 5.00

